{
	"intro": [
		["show_char", "mecano.png"],
		["show_text", "Hey, Jude ! I knew you'd come !"],
		["hide_char"],
		["show_char", "hero.png"],
		["show_text", "You didn't left me any choice... What's the matter ?"],
		["hide_char"],
		["show_char", "mecano.png"],
		["show_text", "Look ! I've just made you a brand new ship ! Look, she's all shiny ! She uses the latest Reno's Uberfaster ! You HAVE to try it !"],
		["hide_char"],
		["show_char", "hero.png"],
		["show_text", "I swore to never get in a cockpit ever again, Maria. You're wasting our time."],
		["hide_char"],
		["show_char", "mecano.png"],
		["show_text", "C'mon, please ! Aboard the Cutie Mach, you'll even be able to take your revenge on Regis Veule ! Don't tell me you wanna see this dickhead on the topscreen forever !"],
		["hide_char"],
		["show_char", "hero.png"],
		["show_text", "..."],
		["hide_char"],
		["show_char", "mecano.png"],
		["show_text", "So, it's settled. Do you remember ? Use UP to climb, DOWN to dive, RIGHT to accelerate and LEFT to brake. Adjust your speed to the difficulty of the map but beware, if you keep slowing down below the base 2000m/s, you'll end up earning no points at all ! The faster you go, the greater the rewards."],
		["hide_char"],
		["show_char", "hero.png"],
		["show_text", "I know how to drive a ship and manage a race..."],
		["hide_char"],
		["show_char", "mecano.png"],
		["show_text", "So, prove it ! Catch the most tokens at the highest speed to maximize your score !"],
		["end_dialog"]
	],

	"fail_lvl1": [
		["show_char", "mecano.png"],
		["show_text", "Oh my, you're really rusty ! That's not good enough."],
		["end_dialog"]
	],

	"win_lvl1": [
		["show_char", "hero.png"],
		["show_text", "Told ya I didn't need tips on how to pilot your Cutie Mach... "],
		["end_dialog"]
	],

	"lvl_2": [
		["show_char", "mecano.png"],
		["show_text", "So, what did ya think about your first dive into the town circuits ? You liked it, don't try to lie to me."],
		["hide_char"],
		["show_char", "hero.png"],
		["show_text", "...it was fun... I'm not used to the adrenaline rush anymore, it was just a distant memory."],
		["hide_char"],
		["show_char", "mecano.png"],
		["show_text", "Please, Jude, it's only been three MONTHS ! I know it feels like ages ago somehow, but... Anyway, are you ready for the next lesson ?"],
		["hide_char"],
		["show_char", "hero.png"],
		["show_text", "Are you sure I need it ?"],
		["hide_char"],
		["show_char", "mecano.png"],
		["show_text", "Now we're going to practice stretching and shrinking the Cutie Mach. Lock yourself on the middle of the map, then deploy your modules one step at a time, following the markers. Once you're at full size, retract your modules in the same fashion."],
		["show_text", "The training pattern will repeat itself twice, then you're on your own. Trying climbing and diving in sync once your reach the tunnels. The last part expects you to stretch as wide as you can, and get yourself aligned with the pellets."],
		["hide_char"],
		["show_char", "hero.png"],
		["show_text", "Yeah, yeah, I know all this already. Been there, done that. I also remember what used to happen to the poor bastards that didn't align themselves properly through the last section..."],
		["end_dialog"]
	],


	"fail_lvl2": [
		["show_char", "mecano.png"],
		["show_text", "Please, Jude, are you even trying ? "],
		["end_dialog"]

	],

	"win_lvl2": [
		["show_char", "mecano.png"],
		["show_text", "Jude, you were awesome ! I'm beginning to think you'll be able to take her to the FFGCC ! Let's do more training !"],
		["hide_char"],
		["show_char", "hero.png"],
		["show_text", "Please, I'm already up for that tournament..."],
		["end_dialog"]
	],

	"lvl_3": [
		["show_char", "mecano.png"],
		["show_text", "I promise it's the last training map before the FFGCC ! The walls are your second nemesis, right after Regis. Take on the right shape to get through the obstacles. The Cutie Mach has a brand new collision detection device, so you'll be warned when a wall comes up. Don't forget that you can let walls slip between your ship and the modules, the whatsit-sparky beams can handle it.."],
		["hide_char"],
		["show_char", "hero.png"],
		["show_text", "I don't need a stupid device, I'll use my intuition, like I always did..."],
		["hide_char"],
		["show_char", "mecano.png"],
		["show_text", "Don't disrespect the awesomeness of my baby, please. And don't ruin the paintjob !"],
		["end_dialog"]
	],


	"fail_lvl3": [
		["show_char", "mecano.png"],
		["show_text", "The booze must have ruined your brain..."],
		["end_dialog"]

	],

	"win_lvl3": [
		["show_char", "mecano.png"],
		["show_text", "Perfect ! Let's get ready for the Fast-Forward Galactic Cup Championship !"],
		["end_dialog"]
	],

	"lvl_4": [
		["show_char", "rival.png"],
		["show_text", "So, you're back ! Somehow I'm not too worried, I bet you'll quit again at the first problem, just like you did last time..."],
		["hide_char"],
		["show_char", "hero.png"],
		["show_text", "Don't take your victory for granted."],
		["hide_char"],
		["show_char", "rival.png"],
		["show_text", "Dream on, d'jude. You don't know it yet, but you're already dead."],
		["end_dialog"]
	],

	"fail_lvl4": [
		["show_char", "rival.png"],
		["show_text", "I never expected better from a looser like you, but I still feel a bit disappointed..."],
		["end_dialog"]

	],

	"win_lvl4": [
		["show_char", "rival.png"],
		["show_text", "Pff ! Lady Luck must have taken pity on a looser like you. You won't make it next time."],
		["end_dialog"]
	],

	"lvl_5": [
		["show_char", "mecano.png"],
		["show_text", "you're doing good ! Just focus, and don't let Regis bug you. There are other competitors in the race."],
		["hide_char"],
		["show_char", "hero.png"],
		["show_text", "I won't forget it. But he'll see how sadly mistaken he was when I'll kick is spandex-thightened ass out of the ring."],
		["hide_char"],
		["show_char", "mecano.png"],
		["show_text", "When did you take the time to look that part of him ?"],
		["end_dialog"]
	],

	"fail_lvl5": [
		["show_char", "mecano.png"],
		["show_text", "Oh, The Cutie Mach is all wrecked... But you're not hurt, so let's see the bright side of the situation ! You'll have your revenge latter..."],
		["end_dialog"]

	],

	"win_lvl5": [
		["show_char", "mecano.png"],
		["show_text", "Jude ! I knew you'd pwn the races ! Your odds improve with each passing race !"],
		["end_dialog"]
	],


	"lvl_6": [
		["show_char", "rival.png"],
		["show_text", "Maria ? I'm really surprised Jude was able to drive a ship again. After his catastrophic failure (see README.md for more explanations), I thought he'd never come back... Will he be OK ?"],
		["hide_char"],
		["show_char", "mecano.png"],
		["show_text", "Oh, you care for him ? It's so sweet from you ! But don't worry, Emo-boy, Jude is perfectly able to kick your ass."],
		["hide_char"],
		["show_char", "rival.png"],
		["show_text", "I don't care for him ! I hope he'll crash so hard his own mother won't be able to recognize him ! I only want a fair victory, this time !"],
		["end_dialog"]
	],


	"fail_lvl6": [
		["show_char", "hero.png"],
		["show_text", "Onoes ! I failed and nobody wrote text for that ! I should complain to the developpers."],
		["end_dialog"]

	],

	"win_lvl6": [
		["show_char", "rival.png"],
		["show_text", "Get lost ! You may be good, but I'm still better than you !"],
		["end_dialog"]
	],

	"lvl_7": [
		["show_char", "rival.png"],
		["show_text", "How could you win all this ! I'm the best ! I won't let you ruin my career, after leaving me like that ! I've always tried to defeat you, and when we finally got a chance to battle, you left me ! I wanted you to know I was better than you, I didn't wan't a victory stained by your abandon !"],
		["hide_char"],
		["show_char", "hero.png"],
		["show_text", "... (I didn't know he would be so obsessed with me... Should I worry ?)"],
		["hide_char"],
		["show_char", "rival.png"],
		["show_text", "I'll never let you take my title ! It's my chance ! You'll have to take me seriously after that !"],
		["end_dialog"]
	],


	"fail_lvl7": [
		["show_char", "rival.png"],
		["show_text", "Ah ! I told you I was the best ! Come again when you want, crybaby, I'll take you the exact same way you like it."],
		["hide_char"],
		["show_char", "hero.png"],
		["show_text", "Next time, you'll eat your teeth... "],
		["end_dialog"]
	],

	"win_lvl7": [
		["show_char", "rival.png"],
		["show_text", "Y... you defeated me ! I trained endlessly and..."],
		["hide_char"],
		["show_char", "hero.png"],
		["show_text", "Regis, stop that. You don't need to win any race to prove to me that you're a great pilot. I always knew it. But... It's not really what you want me to see, is it ?"],
		["hide_char"],
		["show_char", "rival.png"],
		["show_text", "I... I don't know what you're talking about. "],
		["hide_char"],
		["show_char", "hero.png"],
		["show_text", "I should have known before... I'm sorry I made you suffer like that. Let me redeem myself. Do you want us to be friends ?"],
		["hide_char"],
		["show_char", "rival.png"],
		["show_text", "Oh, Jude... You're far more important than any champion title... "],
		["hide_char"],
		["show_char", "mecano.png"],
		["show_text", "... It's easy to say, for the looser..."],
		["end_dialog"]
	]
}
